"""
数据源来自： http://club.excelhome.net/thread-1407198-1-1.html
"""
tier_1 = {"北京", "上海", "广州", "深圳"}

tier_1_5 = {
    "成都", "杭州", "武汉", "重庆", "南京", "天津", "苏州", "西安", "长沙", "沈阳", "青岛", "郑州",
    "大连", "东莞", "宁波"
}
tier_2 = {
    "厦门", "福州", "无锡", "合肥", "昆明", "哈尔滨", "济南", "佛山", "长春", "温州", "石家庄", "南宁",
    "常州", "泉州", "南昌", "贵阳", "太原", "烟台", "嘉兴", "南通", "金华", "珠海", "惠州", "徐州",
    "海口", "乌鲁木齐", "绍兴", "中山", "台州", "兰州"
}
tier_3 = {
    "潍坊", "保定", "镇江", "扬州", "桂林", "唐山", "三亚", "湖州", "呼和浩特", "廊坊", "洛阳", "威海",
    "盐城", "临沂", "江门", "汕头", "泰州", "漳州", "邯郸", "济宁", "芜湖", "淄博", "银川", "柳州",
    "绵阳", "湛江", "鞍山", "赣州", "大庆", "宜昌", "包头", "咸阳", "秦皇岛", "株洲", "莆田", "吉林",
    "淮安", "肇庆", "宁德", "衡阳", "南平", "连云港", "丹东", "丽江", "揭阳", "延边朝鲜族自治州", "舟山",
    "九江", "龙岩", "沧州", "抚顺", "襄阳", "上饶", "营口", "三明", "蚌埠", "丽水", "岳阳", "清远",
    "荆州", "泰安", "衢州", "盘锦", "东营", "南阳", "马鞍山", "南充", "西宁", "孝感", "齐齐哈尔市"
}


def uniqueid():
    seed = 1
    while True:
        yield seed
        seed += 1


id_seq = uniqueid()

print("id, tier, city, note")

for city in tier_1:
    print(f"{next(id_seq)}, 1, {city}, 一线")

for city in tier_1_5:
    print(f"{next(id_seq)}, 2, {city}, 新一线")

for city in tier_2:
    print(f"{next(id_seq)}, 2, {city}, 二线")

for city in tier_3:
    print(f"{next(id_seq)}, 3, {city}, 三线")
